"""
    Частотні методи. Фільтр Баттерворта.
    Перетворення зображень традиційно ведеться в просторовій
області, де маски фільтрів і алгоритми перетворення застосовуються
безпосередньо до матриці зображення. Іншими словами, виконується 
перехід від безпосереднього зображення до його спектру з допомогою
якогось набору його базисних функцій. Сами популярним методом є 
перетворення Фур'є.

    Основними видами фільрів які використовуються є:
    - низькочастотний фільтр, послабляє високі частоти, одночасно
    пропускає низькі
    - високочастотний фільтр, з протилежними властивостями

    Низькі частоти перетворення Фур'є відповідають за виникнення
переважаючих значеннь яскравості на гладких ділянках зображення,
в той час як високі частоти відповідають переважно за контури та
шум. Після використання низькочастотної фільтрації зображення 
порівняно с вихідним зображенням має в собі менше різких деталей.
    В випадку використання високочастотної фільтрації на зображенні
зменшуються зміни яскравості в межах великих гладких областей і
виділяються перехідні зони швидкої зміни яскравості, тобто контури
зображення. Як правило таке зображення має більшу різкість порівняно
з початковим.
    Модель фільтрації зображення в частотній області в загольному
вигляді виглядає як наступний вираз:
            G(u, v) = H(u, v) * F(u, v)
        де:
            F(u, v) - Фур'є образ зображення, який необхідно
            фільтрувати
            H(u, v) - Передаточна функція фільтру
            G(u, v) - Результуюча функція
    Розглянемо фільтри Баттерворта низьких та високих частот.
    Передаточна функція низькочастотного фільра Баттерворта порядку n
на відстані D0 від початку координат зається формулою:
        H(u, v) = 1 /(1 + (2**0.5 - 1) * (D(u, v) / D0)**2n)
    До переваг низькочастотних фільтрів Баттерворта відноситься набагато
менший прояв небажаних ефектів розмиття та поява хибних контурів порівнянно
з ідеальними низькочастотними фільтрами. Із збільшенням порядку
низькочастотного фільтру Баттерворта зростає прояв еффектів розмиття.
Прийнято вважати, що низькочатотний фільтр Баттерворта другого порядку
є оптимальним з точки зору компромісу між еффективністю низькочастотної
фільтрації і достатнім рівнем прояву хибних контурів, та загальної
розмитості зображення.
    Передаточна функція високочастотного фільтра Баттерворта порядку n на
відстані D0 від початку координат зажається формулою:
        H(u, v) = 1 /(1 + (2**0.5 - 1) * (D0/ D(u, v))**2n)
    Фільтри Баттерворта високих частот приводят до набагато менших
спотворень меж об'єктів, ніж ідеальні частотні фільтри Баттерворта. Із
збільшенням порядку високочастотного фільтра Баттерворта спотворення меж
помітно об'єктів помітно збільшується
"""
import cv2
import numpy as np
from matplotlib import pyplot as plt

def batterworth_filter(size, cutoff, n):
    b = np.sqrt(2) - 1
    rows = size[0]
    columns = size[1]

    x = np.linspace(-0.5, 0.5, rows)
    y = np.linspace(-0.5, 0.5, columns)

    radius = np.sqrt((x**2)[np.newaxis] + (y**2)[:, np.newaxis])
    filt = 1 / (1.0 + b * (cutoff / radius)**(2*n))

    return filt

image = cv2.imread("static/object.jpeg")
image = cv2.cvtColor(image, cv2.COLOR_BGR2GRAY)

# Виконуємо дискретне перетворення Фур'є
image_fft = np.fft.fft2(image)

# Отримуємо амплітудний спектр
image_shift = np.fft.fftshift(image_fft) # Функця рухає компонент нульової частоти в центр спектру
image_amp = 20 * np.log(np.abs(image_shift))

# Виводимо початкове зображення та його амплітудний спектр
plt.subplot(121)
plt.imshow(image, cmap="gray")
plt.title("Original Image")
plt.xticks([])
plt.yticks([])

# Використовуємо фільтр
filt = batterworth_filter(image.shape[1::-1], 90, 2)
image_filt = image_fft * filt

# Конвертуємо назад у зображення
image_new = np.real(np.fft.ifft2(np.fft.ifftshift(image_filt)))

# Виводимо зображення
plt.subplot(121)
plt.imshow(image, cmap="gray")
plt.title("Input image")
plt.xticks([])
plt.yticks([])

plt.subplot(122)
plt.imshow(image_new, cmap="gray")
plt.title("Image after filtering")
plt.xticks([])
plt.yticks([])
plt.show()
