import cv2

"""
    Просторовий фільтр підвищення різкості
    Фільтр Лапласа - похідний оператор, який використовується для
пошуку ребр на зображенні. Це похідна маска другого порядку. В цій
масці в нас є ще дві класифікації:
    перша - це додатній(або позитивний) оператор Лапласа
    друга - це від'ємний(або негативний) оператор Лапласа
    Оскільки оператор Лапласа це похідна другого порядку, він підкреслює
преривчасту навівтоновану частину пікселя зображення, не підкреслюючи
при цьому неприривне значення сірої шкали. Це створить чорний фон з
чіткою межою.
    Після запису оператора Лапласа в якості маски фільра його робота
схожа на інші операції просторової фільрації. Необхідно переміщати маску по
рядкам на вихідному зображенні, після чого значення в масці перемножуються
на пікселі які співпадають один з одним, потім сумуюються і присвоюються
пікселям, які співпадають з центром маски. Останні рядки і стовбці зображення
неможна використовувати у вищевказаних операціях. Пікселю присвоюється значення
0 і виходить результат виконання операції Лапласа
            Форма маски додатнього оператора Лапласа
                0  1  0
                1  -4 1
                0  1  0
            Форма маски від'ємного оператора Лапласа
                0  -1 0
                -1 4  -1
                0  -1 0
"""


ddepth = cv2.CV_16S
kernel_size = 3
image = cv2.imread("static/someimage.jpg")

if __name__ == "__main__":
    cv2.imshow("Original Image", image)

    image = cv2.GaussianBlur(image, (3, 3), 0)
    image_gray = cv2.cvtColor(image, cv2.COLOR_BGR2GRAY)

    dst = cv2.Laplacian(image_gray, ddepth=ddepth, ksize=kernel_size)
    abs_dst = cv2.convertScaleAbs(dst=dst)

    cv2.imshow("Filtered image", abs_dst)
    cv2.waitKey(0)
